<!-- tf-plan-comment: terraform-plan-and-apply -->
### Terraform :rocket:
#### Terraform format
```bash

```
#### Terraform validate
```bash
Success! The configuration is valid.


```
#### Terraform plan
```bash
random_password.otel_config_api_key_cocktails_web: Refreshing state... [id=none]
random_password.otel_config_api_key_cocktails_mcp: Refreshing state... [id=none]
random_password.otel_config_api_key_cocktails_api: Refreshing state... [id=none]
local_sensitive_file.otel_config: Refreshing state... [id=075384328436110cc63873849d5e8434b9d9c00a]
data.azurerm_client_config.current: Reading...
data.azurerm_resource_group.global_network_resource_group: Reading...
data.azurerm_resource_group.cocktails_glo_resource_group: Reading...
data.azurerm_resource_group.global_shared_resource_group: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjBhZTE4MC0zNWM4LTQ1ODktYTlkMS1iNjNkOWZkYzhmZmM7b2JqZWN0SWQ9ZmZlZmFiYWMtZmRhNC00ZTVkLWFlZTUtYWZlNTBkYzdkYTkzO3N1YnNjcmlwdGlvbklkPTFkOWVjYzAwLTI0MmEtNDYwZC04YjA4LWI3MWRiMTlmMDk0ZTt0ZW5hbnRJZD1hYmM0OTBlNS0zOTViLTRkYjEtOWQ5Zi0xODQzNGE0NTI2M2Q=]
data.azurerm_resource_group.global_network_resource_group: Read complete after 1s [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-network-001]
azurerm_virtual_network.global_vnet: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-network-001/providers/Microsoft.Network/virtualNetworks/vnet-vec-eus-glo-network-001]
data.azurerm_resource_group.global_shared_resource_group: Read complete after 1s [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001]
azurerm_log_analytics_workspace.law: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.OperationalInsights/workspaces/law-vec-eus-glo-shared-001]
module.shared_servicebus_namespace.azurerm_servicebus_namespace.servicebus_namespace: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ServiceBus/namespaces/sb-vec-eus-glo-shared-001]
azurerm_monitor_action_group.team_vecchi_action_group: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.Insights/actionGroups/ag-teamvecchi-vec-eus-glo-shared]
module.acr.azurerm_container_registry.acr: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ContainerRegistry/registries/acrveceusgloshared001]
module.keyvault.azurerm_key_vault.keyvault: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.KeyVault/vaults/kv-vec-eus-glo-shared-1]
module.ai_search_svc.azurerm_search_service.search: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.Search/searchServices/srch-vec-eus-glo-shared-001]
azurerm_storage_account.otel: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.Storage/storageAccounts/stveceusgloshared001]
azurerm_api_management.apim: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ApiManagement/service/apim-vec-eus-glo-shared-001]
data.azurerm_resource_group.cocktails_glo_resource_group: Read complete after 1s [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-cocktails-001]
azurerm_cdn_frontdoor_profile.afd: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.Cdn/profiles/afd-vec-eus-glo-shared-001]
azurerm_dns_zone.cezzis_dns_zone: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-cocktails-001/providers/Microsoft.Network/dnsZones/cezzis.com]
azurerm_subnet.container_app_environment_subnet: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-network-001/providers/Microsoft.Network/virtualNetworks/vnet-vec-eus-glo-network-001/subnets/snet-vec-eus-glo-sharedcontainers-001]
module.cezzis_keyvault.azurerm_key_vault.keyvault: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-cocktails-001/providers/Microsoft.KeyVault/vaults/kv-vec-eus-glo-cockti-1]
azurerm_application_insights.appi: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.Insights/components/appi-vec-eus-glo-shared-001]
azurerm_log_analytics_workspace_table.law_tables["AppPageViews"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.OperationalInsights/workspaces/law-vec-eus-glo-shared-001/tables/AppPageViews]
azurerm_log_analytics_workspace_table.law_tables["AppDependencies"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.OperationalInsights/workspaces/law-vec-eus-glo-shared-001/tables/AppDependencies]
azurerm_log_analytics_workspace_table.law_tables["AppPerformanceCounters"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.OperationalInsights/workspaces/law-vec-eus-glo-shared-001/tables/AppPerformanceCounters]
azurerm_log_analytics_workspace_table.law_tables["AppEvents"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.OperationalInsights/workspaces/law-vec-eus-glo-shared-001/tables/AppEvents]
azurerm_log_analytics_workspace_table.law_tables["AppExceptions"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.OperationalInsights/workspaces/law-vec-eus-glo-shared-001/tables/AppExceptions]
azurerm_log_analytics_workspace_table.law_tables["AppAvailabilityResults"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.OperationalInsights/workspaces/law-vec-eus-glo-shared-001/tables/AppAvailabilityResults]
azurerm_log_analytics_workspace_table.law_tables["AppSystemEvents"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.OperationalInsights/workspaces/law-vec-eus-glo-shared-001/tables/AppSystemEvents]
azurerm_log_analytics_workspace_table.law_tables["AppBrowserTimings"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.OperationalInsights/workspaces/law-vec-eus-glo-shared-001/tables/AppBrowserTimings]
azurerm_log_analytics_workspace_table.law_tables["AppMetrics"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.OperationalInsights/workspaces/law-vec-eus-glo-shared-001/tables/AppMetrics]
azurerm_log_analytics_workspace_table.law_tables["AppTraces"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.OperationalInsights/workspaces/law-vec-eus-glo-shared-001/tables/AppTraces]
azurerm_log_analytics_workspace_table.law_tables["AppRequests"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.OperationalInsights/workspaces/law-vec-eus-glo-shared-001/tables/AppRequests]
module.keyvault.azurerm_key_vault_access_policy.keyvault_pipeline_access_policy: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.KeyVault/vaults/kv-vec-eus-glo-shared-1/objectId/ffefabac-fda4-4e5d-aee5-afe50dc7da93]
module.cezzis_keyvault.azurerm_key_vault_access_policy.keyvault_pipeline_access_policy: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-cocktails-001/providers/Microsoft.KeyVault/vaults/kv-vec-eus-glo-cockti-1/objectId/ffefabac-fda4-4e5d-aee5-afe50dc7da93]
azurerm_container_app_environment.container_app_environment: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.App/managedEnvironments/cae-vec-eus-glo-shared-001]
module.keyvault.azurerm_key_vault_secret.keyvault_secrets_ignored["github-terraform-module-repo-private-key"]: Refreshing state... [id=https://kv-vec-eus-glo-shared-1.vault.azure.net/secrets/github-terraform-module-repo-private-key/c9fd1883a46441a6abb221c2bc9aa21d]
module.keyvault.azurerm_key_vault_secret.keyvault_secrets_ignored["github-pat-mtnvencenzo-packages-read"]: Refreshing state... [id=https://kv-vec-eus-glo-shared-1.vault.azure.net/secrets/github-pat-mtnvencenzo-packages-read/0195228418f8402981b53a81544018a9]
module.keyvault.azurerm_key_vault_secret.keyvault_secrets_ignored["github-terraform-module-repo-public-key"]: Refreshing state... [id=https://kv-vec-eus-glo-shared-1.vault.azure.net/secrets/github-terraform-module-repo-public-key/19ec19b1fe3a4e459c9ee916280b5538]
module.keyvault.azurerm_key_vault_secret.keyvault_secrets_ignored["github-pat-mtnvencenzo-packages-readwrite"]: Refreshing state... [id=https://kv-vec-eus-glo-shared-1.vault.azure.net/secrets/github-pat-mtnvencenzo-packages-readwrite/06b90e3b94e0420db276fc1204e6653d]
module.keyvault.azurerm_key_vault_secret.keyvault_secrets["otel-collector-api-key-cocktails-web"]: Refreshing state... [id=https://kv-vec-eus-glo-shared-1.vault.azure.net/secrets/otel-collector-api-key-cocktails-web/0fceef54b599449482cefe93a171addc]
module.keyvault.azurerm_key_vault_secret.keyvault_secrets["otel-collector-api-key-cocktails-api"]: Refreshing state... [id=https://kv-vec-eus-glo-shared-1.vault.azure.net/secrets/otel-collector-api-key-cocktails-api/2986f73668d54a5289857b5604e4f589]
module.keyvault.azurerm_key_vault_secret.keyvault_secrets["otel-collector-api-key-cocktails-mcp"]: Refreshing state... [id=https://kv-vec-eus-glo-shared-1.vault.azure.net/secrets/otel-collector-api-key-cocktails-mcp/aaffddb5dba6431ea0db4fbdcf9e71ba]
azurerm_storage_share.otel_config: Refreshing state... [id=https://stveceusgloshared001.file.core.windows.net/share-otel-collector-config]
azurerm_container_app_environment_storage.otel_config: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.App/managedEnvironments/cae-vec-eus-glo-shared-001/storages/st-otel-config]
azurerm_storage_share_file.otel_config_upload: Refreshing state... [id=https://stveceusgloshared001.file.core.windows.net/share-otel-collector-config/otel-collector-config.yml]
azurerm_container_app.otel_collector: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.App/containerApps/aca-vec-eus-glo-otelcol-001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_storage_account.otel will be updated in-place
  ~ resource "azurerm_storage_account" "otel" {
        id                                 = "/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.Storage/storageAccounts/stveceusgloshared001"
        name                               = "stveceusgloshared001"
        tags                               = {
            "Application" = "shared"
            "Environment" = "glo"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass                     = [
              + "AzureServices",
            ]
          + default_action             = "Allow"
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # local_sensitive_file.otel_config will be created
  + resource "local_sensitive_file" "otel_config" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0700"
      + file_permission      = "0700"
      + filename             = "./otel-collector-config.yml"
      + id                   = (known after apply)
    }

  # module.shared_cosmosdb_account.azurerm_cosmosdb_account.cosmosdb_account will be created
  + resource "azurerm_cosmosdb_account" "cosmosdb_account" {
      + access_key_metadata_writes_enabled           = true
      + analytical_storage_enabled                   = false
      + automatic_failover_enabled                   = true
      + burst_capacity_enabled                       = false
      + create_mode                                  = (known after apply)
      + default_identity_type                        = "FirstPartyIdentity"
      + endpoint                                     = (known after apply)
      + free_tier_enabled                            = false
      + id                                           = (known after apply)
      + ip_range_filter                              = [
          + "0.0.0.0",
        ]
      + is_virtual_network_filter_enabled            = true
      + kind                                         = "GlobalDocumentDB"
      + local_authentication_disabled                = false
      + location                                     = "eastus"
      + minimal_tls_version                          = "Tls12"
      + mongo_server_version                         = (known after apply)
      + multiple_write_locations_enabled             = false
      + name                                         = "cosmos-vec-eus-glo-shared-001"
      + network_acl_bypass_for_azure_services        = false
      + offer_type                                   = "Standard"
      + partition_merge_enabled                      = false
      + primary_key                                  = (sensitive value)
      + primary_mongodb_connection_string            = (sensitive value)
      + primary_readonly_key                         = (sensitive value)
      + primary_readonly_mongodb_connection_string   = (sensitive value)
      + primary_readonly_sql_connection_string       = (sensitive value)
      + primary_sql_connection_string                = (sensitive value)
      + public_network_access_enabled                = true
      + read_endpoints                               = (known after apply)
      + resource_group_name                          = "rg-vec-eus-glo-shared-001"
      + secondary_key                                = (sensitive value)
      + secondary_mongodb_connection_string          = (sensitive value)
      + secondary_readonly_key                       = (sensitive value)
      + secondary_readonly_mongodb_connection_string = (sensitive value)
      + secondary_readonly_sql_connection_string     = (sensitive value)
      + secondary_sql_connection_string              = (sensitive value)
      + tags                                         = {
          + "Application" = "shared"
          + "Environment" = "glo"
        }
      + write_endpoints                              = (known after apply)

      + analytical_storage (known after apply)

      + backup (known after apply)

      + capabilities (known after apply)

      + capacity (known after apply)

      + consistency_policy {
          + consistency_level = "Eventual"
        }

      + geo_location {
          + failover_priority = 0
          + id                = (known after apply)
          + location          = "eastus"
          + zone_redundant    = false
        }

      + virtual_network_rule {
          + id                                   = "/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-network-001/providers/Microsoft.Network/virtualNetworks/vnet-vec-eus-glo-network-001/subnets/snet-vec-eus-glo-sharedcontainers-001"
          + ignore_missing_vnet_service_endpoint = false
        }
    }

  # module.shared_cosmosdb_account.azurerm_cosmosdb_sql_role_assignment.sql_custom_reader_role_assignments["3335b819-a0b0-4c0d-a180-79ec100f8930"] will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "sql_custom_reader_role_assignments" {
      + account_name        = "cosmos-vec-eus-glo-shared-001"
      + id                  = (known after apply)
      + name                = "3335b819-a0b0-4c0d-a180-79ec100f8930"
      + principal_id        = "5e688122-9cf3-4b97-98d8-8f14e62466cc"
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + role_definition_id  = (known after apply)
      + scope               = (known after apply)
    }

  # module.shared_cosmosdb_account.azurerm_cosmosdb_sql_role_definition.cosmosdb_custom_contributor_role_definition will be created
  + resource "azurerm_cosmosdb_sql_role_definition" "cosmosdb_custom_contributor_role_definition" {
      + account_name        = "cosmos-vec-eus-glo-shared-001"
      + assignable_scopes   = (known after apply)
      + id                  = (known after apply)
      + name                = "Cosmos DB Custom Data Contributor"
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + role_definition_id  = (known after apply)
      + type                = "CustomRole"

      + permissions {
          + data_actions = [
              + "Microsoft.DocumentDB/databaseAccounts/readMetadata",
              + "Microsoft.DocumentDB/databaseAccounts/sqlDatabases/containers/*",
              + "Microsoft.DocumentDB/databaseAccounts/sqlDatabases/containers/items/*",
            ]
        }
    }

  # module.shared_cosmosdb_account.azurerm_cosmosdb_sql_role_definition.cosmosdb_custom_reader_role_definition will be created
  + resource "azurerm_cosmosdb_sql_role_definition" "cosmosdb_custom_reader_role_definition" {
      + account_name        = "cosmos-vec-eus-glo-shared-001"
      + assignable_scopes   = (known after apply)
      + id                  = (known after apply)
      + name                = "Cosmos DB Custom Data Reader"
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + role_definition_id  = (known after apply)
      + type                = "CustomRole"

      + permissions {
          + data_actions = [
              + "Microsoft.DocumentDB/databaseAccounts/readMetadata",
              + "Microsoft.DocumentDB/databaseAccounts/sqlDatabases/containers/executeQuery",
              + "Microsoft.DocumentDB/databaseAccounts/sqlDatabases/containers/items/read",
              + "Microsoft.DocumentDB/databaseAccounts/sqlDatabases/containers/readChangeFeed",
            ]
        }
    }

  # module.shared_cosmosdb_account.azurerm_role_assignment.cosmos_search_account_reader_role_assignment["5e688122-9cf3-4b97-98d8-8f14e62466cc"] will be created
  + resource "azurerm_role_assignment" "cosmos_search_account_reader_role_assignment" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "5e688122-9cf3-4b97-98d8-8f14e62466cc"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Cosmos DB Account Reader Role"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.shared_cosmosdb_database.azurerm_cosmosdb_sql_database.sql_db will be created
  + resource "azurerm_cosmosdb_sql_database" "sql_db" {
      + account_name        = "cosmos-vec-eus-glo-shared-001"
      + id                  = (known after apply)
      + name                = "shared-db"
      + resource_group_name = "rg-vec-eus-glo-shared-001"
      + throughput          = 400
    }

Plan: 7 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with azurerm_storage_share.otel_config,
  on container_apps_environment_otel.tf line 49, in resource "azurerm_storage_share" "otel_config":
  49:   storage_account_name = azurerm_storage_account.otel.name

This property has been deprecated and will be replaced by
`storage_account_id` in version 5.0 of the provider.

```

*This comment is managed by the terraform-plan-and-apply.yaml workflow and will be updated on subsequent runs.*